In [1]:
import pandas as pd

In [2]:
orders = pd.read_csv('https://raw.githubusercontent.com/dataitgirls3/Data/master/Orders.csv')
orderDetails = pd.read_csv('https://raw.githubusercontent.com/dataitgirls3/Data/master/OrderDetails.csv')
products = pd.read_csv('https://raw.githubusercontent.com/dataitgirls3/Data/master/Products.csv')

# Pandas merge() 함수의 다양한 옵션

In [6]:
# 조인하려는 두 테이블의 기준 컬럼 이름이 같을 때
orders.merge(orderDetails, how='inner', on='OrderID').head(2)

,OrderID,CustomerID,EmployeeID,OrderDate,ShipperID,OrderDetailID,ProductID,Quantity
0,10248,90,5,1996-07-04,3,1,11,12
1,10248,90,5,1996-07-04,3,2,42,10

In [12]:
# 조인하려는 두 테이블의 기준 컬럼 이름이 다를 때
# merge함수의 left_on, right_on 옵션을 활용한다.
orders['ID'] = orders['OrderID']
orders = orders.drop('OrderID', axis=1)
orders.head(2)

   CustomerID  EmployeeID   OrderDate  ShipperID     ID
0          90           5  1996-07-04          3  10248
1          81           6  1996-07-05          1  10249

In [13]:
orders.merge(orderDetails, how='inner', left_on='ID', right_on='OrderID').head(2)

,CustomerID,EmployeeID,OrderDate,ShipperID,ID,OrderDetailID,OrderID,ProductID,Quantity
0,90,5,1996-07-04,3,10248,1,10248,11,12
1,90,5,1996-07-04,3,10248,2,10248,42,10

In [15]:
# 컬럼 대신 인덱스를 조인키로 활용해야 할 때
# merge함수의 left_index, right_index 옵션을 활용한다.
orders = orders.set_index('ID')
orders.head(2)

       CustomerID  EmployeeID   OrderDate  ShipperID
ID
10248          90           5  1996-07-04          3
10249          81           6  1996-07-05          1

In [17]:
orders.merge(orderDetails, left_index=True, right_on='OrderID').head(2)

,CustomerID,EmployeeID,OrderDate,ShipperID,OrderDetailID,OrderID,ProductID,Quantity
0,90,5,1996-07-04,3,1,10248,11,12
1,90,5,1996-07-04,3,2,10248,42,10

# Pandas Series, DataFrame에서의 정렬

In [21]:
# sort_values()를 이용한 Pandas DataFrame에서의 정렬
# 데이터프레임(테이블)에는 컬럼이 여러개 있으므로 
# 어떤 컬럼을 기준으로 정렬할지 by= 옵션에서 선택해준다.
orders.sort_values(by='CustomerID', ascending=False).head(2)

       CustomerID  EmployeeID   OrderDate  ShipperID
ID
10374          91           1  1996-12-05          3
10248          90           5  1996-07-04          3

In [26]:
# sort_values()를 이용한 Pandas Series에서의 정렬
print(type(orders['OrderDate']))
s = orders['OrderDate']

<class 'pandas.core.series.Series'>

In [28]:
s.sort_values(ascending=False)

ID
10443    1997-02-12
10442    1997-02-11
10441    1997-02-10
10440    1997-02-10
10439    1997-02-07
            ...
10252    1996-07-09
10251    1996-07-08
10250    1996-07-08
10249    1996-07-05
10248    1996-07-04
Name: OrderDate, Length: 196, dtype: object